# Дан список чисел. Определите, сколько в нем встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# list_1 = [1, 1, 2, 0, -1, 3, 4, 4]
# list_11 = set(list_1)
# print(len(list_11))

# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность 
# (сдвиг - циклический) на K элементов вправо, K – положительное число.
# Input: [1, 2, 3, 4, 5] k = 2
# Output: [4, 5, 1, 2, 3]


# list_2 = [1, 2, 3, 4, 5]
# k = 2
# list_3 = [0]*len(list_2)
# for i in range(len(list_2)):
#     list_3[i] = list_2[(i-k)]
# print(list_3)

# # Вариант 2

# a = [1,2,3,4,5,6,7,8,9,10,11]
# k = 4
# for i in range(k):
#     a.insert(0,a.pop(-1))
# print(a)

# №21. Напишите программу для печати всех уникальных  значений в словаре.  
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}] 
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}
# Примечание: Список словарей задан изначально. 
# Пользователь его не вводит

# dictionary = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

# list_4 = []

# for v in dictionary:
#     for value in v.values():
#         list_4.append(value.strip()) 

# print(*set(list_4))

# 23. Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает количество элементов массива, 
# больших предыдущего (элемента с предыдущим номером) 
# Input: [0, -1, 5, 2, 3]
# Output: 2 Разъяснение (-1 < 5, 2 < 3)

count = 0
list_5 = [0, -1, 5, 2, 3, 5, 6, 2]
for i in range(len(list_5)-1):
    if list_5[i] < list_5[i+1]:
        count += 1
print(count)